first.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.First test": 499,
      "vusers.created": 499,
      "http.requests": 499,
      "http.codes.200": 202,
      "http.responses": 499,
      "vusers.failed": 0,
      "vusers.completed": 499,
      "http.codes.429": 297,
      "vusers.skipped": 1
    },
    "rates": {
      "http.request_rate": 5
    },
    "firstCounterAt": 1677616257667,
    "firstHistogramAt": 1677616258520,
    "lastCounterAt": 1677616357470,
    "lastHistogramAt": 1677616357470,
    "firstMetricAt": 1677616257667,
    "lastMetricAt": 1677616357470,
    "period": 1677616350000,
    "summaries": {
      "http.response_time": {
        "min": 162,
        "max": 2743,
        "count": 499,
        "p50": 278.7,
        "median": 278.7,
        "p75": 407.5,
        "p90": 620.3,
        "p95": 742.6,
        "p99": 1224.4,
        "p999": 2618.1
      },
      "vusers.session_length": {
        "min": 528.1,
        "max": 5837.2,
        "count": 499,
        "p50": 871.5,
        "median": 871.5,
        "p75": 1224.4,
        "p90": 1620,
        "p95": 2101.1,
        "p99": 3828.5,
        "p999": 4403.8
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 162,
        "max": 2743,
        "count": 499,
        "p50": 278.7,
        "median": 278.7,
        "p75": 407.5,
        "p90": 620.3,
        "p95": 742.6,
        "p99": 1224.4,
        "p999": 2618.1
      },
      "vusers.session_length": {
        "min": 528.1,
        "max": 5837.2,
        "count": 499,
        "p50": 871.5,
        "median": 871.5,
        "p75": 1224.4,
        "p90": 1620,
        "p95": 2101.1,
        "p99": 3828.5,
        "p999": 4403.8
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.First test": 15,
        "vusers.created": 15,
        "http.requests": 15,
        "http.codes.200": 10,
        "http.responses": 10,
        "vusers.failed": 0,
        "vusers.completed": 10
      },
      "rates": {
        "http.request_rate": 10
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616257667,
      "firstHistogramAt": 1677616258520,
      "lastCounterAt": 1677616259873,
      "lastHistogramAt": 1677616259509,
      "firstMetricAt": 1677616257667,
      "lastMetricAt": 1677616259873,
      "period": "1677616250000",
      "summaries": {
        "http.response_time": {
          "min": 189,
          "max": 714,
          "count": 10,
          "p50": 247.2,
          "median": 247.2,
          "p75": 284.3,
          "p90": 713.5,
          "p95": 713.5,
          "p99": 713.5,
          "p999": 713.5
        },
        "vusers.session_length": {
          "min": 635.8,
          "max": 1274.4,
          "count": 10,
          "p50": 788.5,
          "median": 788.5,
          "p75": 854.2,
          "p90": 1176.4,
          "p95": 1176.4,
          "p99": 1176.4,
          "p999": 1176.4
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 189,
          "max": 714,
          "count": 10,
          "p50": 247.2,
          "median": 247.2,
          "p75": 284.3,
          "p90": 713.5,
          "p95": 713.5,
          "p99": 713.5,
          "p999": 713.5
        },
        "vusers.session_length": {
          "min": 635.8,
          "max": 1274.4,
          "count": 10,
          "p50": 788.5,
          "median": 788.5,
          "p75": 854.2,
          "p90": 1176.4,
          "p95": 1176.4,
          "p99": 1176.4,
          "p999": 1176.4
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 50,
        "http.responses": 50,
        "vusers.failed": 0,
        "vusers.completed": 50,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616260392,
      "firstHistogramAt": 1677616260393,
      "lastCounterAt": 1677616269873,
      "lastHistogramAt": 1677616269669,
      "firstMetricAt": 1677616260392,
      "lastMetricAt": 1677616269873,
      "period": "1677616260000",
      "summaries": {
        "http.response_time": {
          "min": 172,
          "max": 1134,
          "count": 50,
          "p50": 247.2,
          "median": 247.2,
          "p75": 320.6,
          "p90": 699.4,
          "p95": 713.5,
          "p99": 944,
          "p999": 944
        },
        "vusers.session_length": {
          "min": 528.1,
          "max": 2162.5,
          "count": 50,
          "p50": 820.7,
          "median": 820.7,
          "p75": 1326.4,
          "p90": 1525.7,
          "p95": 1901.1,
          "p99": 2101.1,
          "p999": 2101.1
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 172,
          "max": 1134,
          "count": 50,
          "p50": 247.2,
          "median": 247.2,
          "p75": 320.6,
          "p90": 699.4,
          "p95": 713.5,
          "p99": 944,
          "p999": 944
        },
        "vusers.session_length": {
          "min": 528.1,
          "max": 2162.5,
          "count": 50,
          "p50": 820.7,
          "median": 820.7,
          "p75": 1326.4,
          "p90": 1525.7,
          "p95": 1901.1,
          "p99": 2101.1,
          "p999": 2101.1
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 40,
        "http.responses": 45,
        "vusers.failed": 0,
        "vusers.completed": 45,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50,
        "http.codes.429": 5
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616270384,
      "firstHistogramAt": 1677616270384,
      "lastCounterAt": 1677616279874,
      "lastHistogramAt": 1677616279451,
      "firstMetricAt": 1677616270384,
      "lastMetricAt": 1677616279874,
      "period": "1677616270000",
      "summaries": {
        "http.response_time": {
          "min": 183,
          "max": 1217,
          "count": 45,
          "p50": 262.5,
          "median": 262.5,
          "p75": 301.9,
          "p90": 415.8,
          "p95": 685.5,
          "p99": 1153.1,
          "p999": 1153.1
        },
        "vusers.session_length": {
          "min": 559.4,
          "max": 2262.5,
          "count": 45,
          "p50": 742.6,
          "median": 742.6,
          "p75": 1274.3,
          "p90": 1620,
          "p95": 2101.1,
          "p99": 2231,
          "p999": 2231
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 183,
          "max": 1217,
          "count": 45,
          "p50": 262.5,
          "median": 262.5,
          "p75": 301.9,
          "p90": 415.8,
          "p95": 685.5,
          "p99": 1153.1,
          "p999": 1153.1
        },
        "vusers.session_length": {
          "min": 559.4,
          "max": 2262.5,
          "count": 45,
          "p50": 742.6,
          "median": 742.6,
          "p75": 1274.3,
          "p90": 1620,
          "p95": 2101.1,
          "p99": 2231,
          "p999": 2231
        }
      }
    },
    {
      "counters": {
        "http.codes.429": 50,
        "http.responses": 50,
        "vusers.failed": 0,
        "vusers.completed": 50,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616280032,
      "firstHistogramAt": 1677616280032,
      "lastCounterAt": 1677616289873,
      "lastHistogramAt": 1677616289166,
      "firstMetricAt": 1677616280032,
      "lastMetricAt": 1677616289873,
      "period": "1677616280000",
      "summaries": {
        "http.response_time": {
          "min": 169,
          "max": 971,
          "count": 50,
          "p50": 290.1,
          "median": 290.1,
          "p75": 399.5,
          "p90": 608,
          "p95": 608,
          "p99": 620.3,
          "p999": 620.3
        },
        "vusers.session_length": {
          "min": 594.7,
          "max": 1867.1,
          "count": 50,
          "p50": 788.5,
          "median": 788.5,
          "p75": 982.6,
          "p90": 1380.5,
          "p95": 1408.4,
          "p99": 1495.5,
          "p999": 1495.5
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 169,
          "max": 971,
          "count": 50,
          "p50": 290.1,
          "median": 290.1,
          "p75": 399.5,
          "p90": 608,
          "p95": 608,
          "p99": 620.3,
          "p999": 620.3
        },
        "vusers.session_length": {
          "min": 594.7,
          "max": 1867.1,
          "count": 50,
          "p50": 788.5,
          "median": 788.5,
          "p75": 982.6,
          "p90": 1380.5,
          "p95": 1408.4,
          "p99": 1495.5,
          "p999": 1495.5
        }
      }
    },
    {
      "counters": {
        "http.codes.429": 55,
        "http.responses": 55,
        "vusers.failed": 0,
        "vusers.completed": 55,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616290041,
      "firstHistogramAt": 1677616290041,
      "lastCounterAt": 1677616299873,
      "lastHistogramAt": 1677616299707,
      "firstMetricAt": 1677616290041,
      "lastMetricAt": 1677616299873,
      "period": "1677616290000",
      "summaries": {
        "http.response_time": {
          "min": 164,
          "max": 865,
          "count": 55,
          "p50": 273.2,
          "median": 273.2,
          "p75": 391.6,
          "p90": 518.1,
          "p95": 561.2,
          "p99": 871.5,
          "p999": 871.5
        },
        "vusers.session_length": {
          "min": 554.9,
          "max": 2031.4,
          "count": 55,
          "p50": 820.7,
          "median": 820.7,
          "p75": 1022.7,
          "p90": 1326.4,
          "p95": 1436.8,
          "p99": 1495.5,
          "p999": 1495.5
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 164,
          "max": 865,
          "count": 55,
          "p50": 273.2,
          "median": 273.2,
          "p75": 391.6,
          "p90": 518.1,
          "p95": 561.2,
          "p99": 871.5,
          "p999": 871.5
        },
        "vusers.session_length": {
          "min": 554.9,
          "max": 2031.4,
          "count": 55,
          "p50": 820.7,
          "median": 820.7,
          "p75": 1022.7,
          "p90": 1326.4,
          "p95": 1436.8,
          "p99": 1495.5,
          "p999": 1495.5
        }
      }
    },
    {
      "counters": {
        "http.codes.429": 43,
        "http.responses": 43,
        "vusers.failed": 0,
        "vusers.completed": 43,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616300412,
      "firstHistogramAt": 1677616300412,
      "lastCounterAt": 1677616309873,
      "lastHistogramAt": 1677616309111,
      "firstMetricAt": 1677616300412,
      "lastMetricAt": 1677616309873,
      "period": "1677616300000",
      "summaries": {
        "http.response_time": {
          "min": 162,
          "max": 1028,
          "count": 43,
          "p50": 347.3,
          "median": 347.3,
          "p75": 376.2,
          "p90": 468.8,
          "p95": 620.3,
          "p99": 982.6,
          "p999": 982.6
        },
        "vusers.session_length": {
          "min": 577,
          "max": 2086.5,
          "count": 43,
          "p50": 982.6,
          "median": 982.6,
          "p75": 1408.4,
          "p90": 1652.8,
          "p95": 1978.7,
          "p99": 2059.5,
          "p999": 2059.5
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 162,
          "max": 1028,
          "count": 43,
          "p50": 347.3,
          "median": 347.3,
          "p75": 376.2,
          "p90": 468.8,
          "p95": 620.3,
          "p99": 982.6,
          "p999": 982.6
        },
        "vusers.session_length": {
          "min": 577,
          "max": 2086.5,
          "count": 43,
          "p50": 982.6,
          "median": 982.6,
          "p75": 1408.4,
          "p90": 1652.8,
          "p95": 1978.7,
          "p99": 2059.5,
          "p999": 2059.5
        }
      }
    },
    {
      "counters": {
        "http.codes.429": 46,
        "http.responses": 56,
        "vusers.failed": 0,
        "vusers.completed": 56,
        "vusers.created_by_name.First test": 49,
        "vusers.created": 49,
        "http.requests": 49,
        "http.codes.200": 10,
        "vusers.skipped": 1
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616310229,
      "firstHistogramAt": 1677616310229,
      "lastCounterAt": 1677616319874,
      "lastHistogramAt": 1677616319517,
      "firstMetricAt": 1677616310229,
      "lastMetricAt": 1677616319874,
      "period": "1677616310000",
      "summaries": {
        "http.response_time": {
          "min": 167,
          "max": 2743,
          "count": 56,
          "p50": 273.2,
          "median": 273.2,
          "p75": 450.4,
          "p90": 1153.1,
          "p95": 1826.6,
          "p99": 2618.1,
          "p999": 2618.1
        },
        "vusers.session_length": {
          "min": 564.5,
          "max": 4402.2,
          "count": 56,
          "p50": 1043.3,
          "median": 1043.3,
          "p75": 1978.7,
          "p90": 3072.4,
          "p95": 3828.5,
          "p99": 4316.6,
          "p999": 4316.6
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 167,
          "max": 2743,
          "count": 56,
          "p50": 273.2,
          "median": 273.2,
          "p75": 450.4,
          "p90": 1153.1,
          "p95": 1826.6,
          "p99": 2618.1,
          "p999": 2618.1
        },
        "vusers.session_length": {
          "min": 564.5,
          "max": 4402.2,
          "count": 56,
          "p50": 1043.3,
          "median": 1043.3,
          "p75": 1978.7,
          "p90": 3072.4,
          "p95": 3828.5,
          "p99": 4316.6,
          "p999": 4316.6
        }
      }
    },
    {
      "counters": {
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50,
        "http.codes.200": 44,
        "http.responses": 44,
        "vusers.failed": 0,
        "vusers.completed": 44
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616320666,
      "firstHistogramAt": 1677616320941,
      "lastCounterAt": 1677616329874,
      "lastHistogramAt": 1677616329528,
      "firstMetricAt": 1677616320666,
      "lastMetricAt": 1677616329874,
      "period": "1677616320000",
      "summaries": {
        "http.response_time": {
          "min": 176,
          "max": 844,
          "count": 44,
          "p50": 415.8,
          "median": 415.8,
          "p75": 528.6,
          "p90": 713.5,
          "p95": 837.3,
          "p99": 837.3,
          "p999": 837.3
        },
        "vusers.session_length": {
          "min": 602,
          "max": 1850.8,
          "count": 44,
          "p50": 982.6,
          "median": 982.6,
          "p75": 1380.5,
          "p90": 1652.8,
          "p95": 1755,
          "p99": 1790.4,
          "p999": 1790.4
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 176,
          "max": 844,
          "count": 44,
          "p50": 415.8,
          "median": 415.8,
          "p75": 528.6,
          "p90": 713.5,
          "p95": 837.3,
          "p99": 837.3,
          "p999": 837.3
        },
        "vusers.session_length": {
          "min": 602,
          "max": 1850.8,
          "count": 44,
          "p50": 982.6,
          "median": 982.6,
          "p75": 1380.5,
          "p90": 1652.8,
          "p95": 1755,
          "p99": 1790.4,
          "p999": 1790.4
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 48,
        "http.responses": 56,
        "vusers.failed": 0,
        "vusers.completed": 56,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50,
        "http.codes.429": 8
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616330033,
      "firstHistogramAt": 1677616330033,
      "lastCounterAt": 1677616339873,
      "lastHistogramAt": 1677616339598,
      "firstMetricAt": 1677616330033,
      "lastMetricAt": 1677616339873,
      "period": "1677616330000",
      "summaries": {
        "http.response_time": {
          "min": 178,
          "max": 992,
          "count": 56,
          "p50": 278.7,
          "median": 278.7,
          "p75": 450.4,
          "p90": 584.2,
          "p95": 671.9,
          "p99": 671.9,
          "p999": 671.9
        },
        "vusers.session_length": {
          "min": 563.7,
          "max": 5837.2,
          "count": 56,
          "p50": 925.4,
          "median": 925.4,
          "p75": 1085.9,
          "p90": 1408.4,
          "p95": 2186.8,
          "p99": 4403.8,
          "p999": 4403.8
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 178,
          "max": 992,
          "count": 56,
          "p50": 278.7,
          "median": 278.7,
          "p75": 450.4,
          "p90": 584.2,
          "p95": 671.9,
          "p99": 671.9,
          "p999": 671.9
        },
        "vusers.session_length": {
          "min": 563.7,
          "max": 5837.2,
          "count": 56,
          "p50": 925.4,
          "median": 925.4,
          "p75": 1085.9,
          "p90": 1408.4,
          "p95": 2186.8,
          "p99": 4403.8,
          "p999": 4403.8
        }
      }
    },
    {
      "counters": {
        "http.codes.429": 50,
        "http.responses": 50,
        "vusers.failed": 0,
        "vusers.completed": 50,
        "vusers.created_by_name.First test": 50,
        "vusers.created": 50,
        "http.requests": 50
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616340542,
      "firstHistogramAt": 1677616340542,
      "lastCounterAt": 1677616349873,
      "lastHistogramAt": 1677616349787,
      "firstMetricAt": 1677616340542,
      "lastMetricAt": 1677616349873,
      "period": "1677616340000",
      "summaries": {
        "http.response_time": {
          "min": 167,
          "max": 660,
          "count": 50,
          "p50": 301.9,
          "median": 301.9,
          "p75": 407.5,
          "p90": 487.9,
          "p95": 645.6,
          "p99": 658.6,
          "p999": 658.6
        },
        "vusers.session_length": {
          "min": 599.8,
          "max": 1453.8,
          "count": 50,
          "p50": 907,
          "median": 907,
          "p75": 1002.4,
          "p90": 1153.1,
          "p95": 1300.1,
          "p99": 1408.4,
          "p999": 1408.4
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 167,
          "max": 660,
          "count": 50,
          "p50": 301.9,
          "median": 301.9,
          "p75": 407.5,
          "p90": 487.9,
          "p95": 645.6,
          "p99": 658.6,
          "p999": 658.6
        },
        "vusers.session_length": {
          "min": 599.8,
          "max": 1453.8,
          "count": 50,
          "p50": 907,
          "median": 907,
          "p75": 1002.4,
          "p90": 1153.1,
          "p95": 1300.1,
          "p99": 1408.4,
          "p999": 1408.4
        }
      }
    },
    {
      "counters": {
        "http.codes.429": 40,
        "http.responses": 40,
        "vusers.failed": 0,
        "vusers.completed": 40,
        "vusers.created_by_name.First test": 35,
        "vusers.created": 35,
        "http.requests": 35
      },
      "rates": {
        "http.request_rate": 5
      },
      "http.request_rate": null,
      "firstCounterAt": 1677616350573,
      "firstHistogramAt": 1677616350573,
      "lastCounterAt": 1677616357470,
      "lastHistogramAt": 1677616357470,
      "firstMetricAt": 1677616350573,
      "lastMetricAt": 1677616357470,
      "period": "1677616350000",
      "summaries": {
        "http.response_time": {
          "min": 169,
          "max": 1131,
          "count": 40,
          "p50": 219.2,
          "median": 219.2,
          "p75": 278.7,
          "p90": 528.6,
          "p95": 528.6,
          "p99": 550.1,
          "p999": 550.1
        },
        "vusers.session_length": {
          "min": 556.5,
          "max": 3317.2,
          "count": 40,
          "p50": 685.5,
          "median": 685.5,
          "p75": 944,
          "p90": 2018.7,
          "p95": 2369,
          "p99": 2671,
          "p999": 2671
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 169,
          "max": 1131,
          "count": 40,
          "p50": 219.2,
          "median": 219.2,
          "p75": 278.7,
          "p90": 528.6,
          "p95": 528.6,
          "p99": 550.1,
          "p999": 550.1
        },
        "vusers.session_length": {
          "min": 556.5,
          "max": 3317.2,
          "count": 40,
          "p50": 685.5,
          "median": 685.5,
          "p75": 944,
          "p90": 2018.7,
          "p95": 2369,
          "p99": 2671,
          "p999": 2671
        }
      }
    }
  ]
}